## Extensive Libraries: The Power of Pandas, NumPy, and Beyond

In [1]:
import pandas as pd
import numpy as np

# Create a simple DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [24, 27, 22, 32],
        'Salary': [48000, 52000, 45000, 60000]}

df = pd.DataFrame(data)

# Add a new column with a NumPy function
df['Bonus'] = np.random.randint(1000, 5000, size=len(df))

print(df)

      Name  Age  Salary  Bonus
0    Alice   24   48000   2910
1      Bob   27   52000   4651
2  Charlie   22   45000   2648
3    David   32   60000   1219

## Integration: Python in Real-World Data Science

In [1]:
import sqlite3
import pandas as pd

# Connect to an in-memory SQLite database
conn = sqlite3.connect(':memory:')

# Create a simple table
conn.execute('''CREATE TABLE employees (name TEXT, age INTEGER, salary REAL)''')
conn.execute('''INSERT INTO employees VALUES ('Alice', 24, 48000)''')
conn.execute('''INSERT INTO employees VALUES ('Bob', 27, 52000)''')

# Fetch data into a Pandas DataFrame
df = pd.read_sql_query('SELECT * FROM employees', conn)

# Display the DataFrame
print(df)

    name  age   salary
0  Alice   24  48000.0
1    Bob   27  52000.0